# Task 1 Lesson 2
# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать фун-цию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

# Option 1
my_list = [2, 1.5, "Apple", True, None, complex(5, 5)]
for el in my_list:
    print(type(el))

# Option 2


